._design_docs/.test_reports/test-report-20260603-03-artifacts/bench/k6-stdout.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: D:\source\llama.cpp-jet\tools\server\tests\bench-cache-correctness.js
        output: json (._design_docs\.test_reports\test-report-20260603-03-artifacts\bench\k6-results.json)

     scenarios: (100.00%) 2 scenarios, 2 max VUs, 5m30s max duration (incl. graceful stop):
              * hit_probe: 11 iterations shared among 1 VUs (maxDuration: 5m0s, exec: doProbe, gracefulStop: 30s)
              * warmup: 1 iterations shared among 1 VUs (maxDuration: 2m0s, exec: doWarmup, gracefulStop: 30s)


running (0m01.0s), 1/2 VUs, 5 complete and 0 interrupted iterations
hit_probe   [  36% ] 1 VUs  0m01.0s/5m0s  04/11 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m00.4s/2m0s  1/1 shared iters

running (0m02.0s), 1/2 VUs, 10 complete and 0 interrupted iterations
hit_probe   [  82% ] 1 VUs  0m02.0s/5m0s  09/11 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m00.4s/2m0s  1/1 shared iters


  █ THRESHOLDS 

    cache_hit_rate
    ✓ 'rate>=0.60' rate=100.00%

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 12      5.19318/s
    checks_succeeded...: 100.00% 12 out of 12
    checks_failed......: 0.00%   0 out of 12

    ✓ probe 200
    ✓ warmup 200

    CUSTOM
    cache_hit_prompt_ms............: avg=13.91ms  min=12.07ms  med=13.52ms  p(95)=16.75ms  max=18.98ms 
    cache_hit_rate.................: 100.00% 11 out of 11
    cache_miss_prompt_ms...........: avg=12.94ms  min=12.94ms  med=12.94ms  p(95)=12.94ms  max=12.94ms 
    cache_n_tokens.................: avg=4        min=4        med=4        p(95)=4        max=4       
    requests_ok....................: 12      5.19318/s

    HTTP
    http_req_duration..............: avg=118.35ms min=101.66ms med=111.27ms p(95)=159.98ms max=214.99ms
      { expected_response:true }...: avg=118.35ms min=101.66ms med=111.27ms p(95)=159.98ms max=214.99ms
    http_req_failed................: 0.00%   0 out of 12
    http_reqs......................: 12      5.19318/s

    EXECUTION
    iteration_duration.............: avg=227.26ms min=201.97ms med=211.46ms p(95)=305.68ms max=416.45ms
    iterations.....................: 12      5.19318/s
    vus............................: 1       min=1        max=1
    vus_max........................: 2       min=2        max=2

    NETWORK
    data_received..................: 22 kB   9.3 kB/s
    data_sent......................: 3.1 kB  1.3 kB/s



running (0m02.3s), 0/2 VUs, 12 complete and 0 interrupted iterations
hit_probe ✓ [ 100% ] 1 VUs  0m02.3s/5m0s  11/11 shared iters
warmup    ✓ [ 100% ] 1 VUs  0m00.4s/2m0s  1/1 shared iters